genestealer/everblu-meters-esp8266-improved/src/main.cpp
  // Validate METER_SERIAL (should not be 0, and should be reasonable length)
  // Serial format on meter: XX-YYYYYYY-ZZZ (use only middle part YYYYYYY)
  // Note: If middle part starts with 0, omit leading zeros (e.g., 0123456 → 123456)
  if (METER_SERIAL == 0)
  {
    Serial.println("ERROR: METER_SERIAL not configured (value is 0)");
    Serial.println("       Use the middle part of your meter's serial number");
    Serial.println("       Example: Serial '23-1875247-234' → use 1875247");
    valid = false;
  }
  else if (METER_SERIAL > 99999999UL) // 8 digits max (most serials are 6-7 digits)
  {
    Serial.printf("ERROR: METER_SERIAL=%lu seems too long (>8 digits)\n", (unsigned long)METER_SERIAL);
    Serial.println("       Use only the middle part of the serial (ignore last part)");
    Serial.println("       Example: Serial '23-1875247-234' → use 1875247 (not 1875247234)");
    valid = false;
  }
  else if (METER_SERIAL < 10UL) // Very suspiciously short (< 2 digits)
  {
    Serial.printf("WARNING: METER_SERIAL=%lu is very short (<2 digits)\n", (unsigned long)METER_SERIAL);
    Serial.println("         Double-check you entered the complete middle part");
    Serial.printf("⚠ METER_SERIAL: %lu\n", (unsigned long)METER_SERIAL);
  }
  else if (METER_SERIAL < 1000UL) // Possibly correct if serial had leading zeros
  {
    Serial.printf("✓ METER_SERIAL: %lu (if your serial started with zeros, this is correct)\n", (unsigned long)METER_SERIAL);
  }
  else
  {
    Serial.printf("✓ METER_SERIAL: %lu\n", (unsigned long)METER_SERIAL);
  }

// Validate FREQUENCY if defined (should be 300-500 MHz for 433 MHz band)
#ifdef FREQUENCY
  if (FREQUENCY < 300.0 || FREQUENCY > 500.0)
  {
    Serial.printf("ERROR: Invalid FREQUENCY=%.2f MHz (expected 300-500 MHz)\n", FREQUENCY);
    valid = false;
  }
  else
  {
    Serial.printf("✓ FREQUENCY: %.6f MHz\n", FREQUENCY);
  }
#else
  Serial.println("✓ FREQUENCY: Using default 433.82 MHz (RADIAN protocol)");
#endif

  // Validate reading time defaults (UTC)
  if (DEFAULT_READING_HOUR_UTC < 0 || DEFAULT_READING_HOUR_UTC > 23)
  {
    Serial.printf("ERROR: Invalid DEFAULT_READING_HOUR_UTC=%d (expected 0-23)\n", DEFAULT_READING_HOUR_UTC);
    valid = false;
  }
  else if (DEFAULT_READING_MINUTE_UTC < 0 || DEFAULT_READING_MINUTE_UTC > 59)
  {
    Serial.printf("ERROR: Invalid DEFAULT_READING_MINUTE_UTC=%d (expected 0-59)\n", DEFAULT_READING_MINUTE_UTC);
    valid = false;
  }
  else
  {
    Serial.printf("✓ Reading Time (UTC): %02d:%02d\n", DEFAULT_READING_HOUR_UTC, DEFAULT_READING_MINUTE_UTC);
  }

// Validate GDO0 pin (basic check - should be defined)
#ifdef GDO0
  Serial.printf("✓ GDO0 Pin: GPIO %d\n", GDO0);
#else
  Serial.println("ERROR: GDO0 pin not defined in private.h");
  valid = false;
#endif

  // Validate reading schedule
  if (!isValidReadingSchedule(readingSchedule))
  {
    Serial.printf("WARNING: Invalid reading schedule '%s'. Will fall back to 'Monday-Friday'.\n", readingSchedule);
    Serial.println("         Expected: 'Monday-Friday', 'Monday-Saturday', or 'Monday-Sunday'");
  }
  else
  {
    Serial.printf("✓ Reading Schedule: %s\n", readingSchedule);
  }

  Serial.println("================================\n");

  return valid;
}

// Function: setup
// Description: Initializes the device, including serial communication, Wi-Fi, MQTT, and CC1101 radio with automatic calibration.
void setup()
{
  Serial.begin(115200);
  Serial.println("\n");
  // Give Serial a moment to initialize
  delay(100);

// On platforms with native USB Serial (e.g. some ESP32 cores) wait briefly for host to open the port
#if defined(ESP32)
  unsigned long __serial_wait_start = millis();
  while (!Serial && millis() - __serial_wait_start < 1000)
  {
    delay(10);
  }
#endif
  Serial.println("Everblu Meters ESP8266/ESP32 Starting...");
  Serial.println("Water/Gas usage data for Home Assistant");
  Serial.println("https://github.com/genestealer/everblu-meters-esp8266-improved");
  Serial.printf("Firmware version: %s\n", EVERBLU_FW_VERSION);
  Serial.printf("Target meter: 20%02d-%07lu\n\n", METER_YEAR, (unsigned long)METER_SERIAL);

  // Initialize meter type configuration
  initMeterTypeConfig();

  // Validate configuration before proceeding
  if (!validateConfiguration())
  {
    Serial.println("\n*** FATAL: Configuration validation failed! ***");
    Serial.println("*** Fix the errors in private.h and reflash ***");
    Serial.println("*** Device halted - will not continue ***\n");
    while (1)
    {
      digitalWrite(LED_BUILTIN, LOW); // Blink LED to indicate error
      delay(200);
      digitalWrite(LED_BUILTIN, HIGH);
      delay(200);
    }
  }

  // Initialize resolved schedule caches using UTC defaults and configured timezone offset
  updateResolvedScheduleFromUtc(DEFAULT_READING_HOUR_UTC, DEFAULT_READING_MINUTE_UTC);

  Serial.println("✓ Configuration valid - proceeding with initialization\n");

  // Note: mqttBaseTopic and meterSerialStr are initialized at global scope
  // to ensure they're ready when EspMQTTClient constructor runs
  Serial.printf("> MQTT base topic: %s\n", mqttBaseTopic);
  Serial.printf("> Meter serial string: %s\n", meterSerialStr);
  Serial.printf("> mqttBaseTopic length: %d\n", strlen(mqttBaseTopic));

  pinMode(LED_BUILTIN, OUTPUT);
  digitalWrite(LED_BUILTIN, LOW); // turned on to start with

  // Initialize persistent storage
#if defined(ESP8266)
  EEPROM.begin(EEPROM_SIZE);
  Serial.println("> EEPROM initialized");

  // Clear EEPROM if requested (set CLEAR_EEPROM_ON_BOOT=1 in private.h)
  // Use this when replacing ESP board, CC1101 module, or moving to a different meter
#if CLEAR_EEPROM_ON_BOOT
  Serial.println("> CLEARING EEPROM (CLEAR_EEPROM_ON_BOOT = 1)...");
  for (int i = 0; i < EEPROM_SIZE; i++)
  {
    EEPROM.write(i, 0xFF);
  }
  EEPROM.commit();
  Serial.println("> EEPROM cleared. Remember to set CLEAR_EEPROM_ON_BOOT = 0 after testing!");
#endif
#endif

  // Load stored frequency offset
  storedFrequencyOffset = loadFrequencyOffset();

